// Створити функцію яка отримує аргументом новий самйл та масиив і змінює  в масиві смайл  '':) ' на новий смайл і повертає массив смайлів ( виконати з return)
let smile = [':)', '=)', ':)', '=)', ':)', '=)']; function createForm() {

    arguments(':) ')
}

// 2)Створити функцію яка  отримує массив і функцію колбек.Функція обробляє массив обєктів і вираховує площу фігури з даних в обєкті використовуючи колбек.Результатом виконання буде маси з результатами['Площа  Squar 12' .... ]
// Формула для обчислення площі  A * B
// let figurs = [
//     {
//         figure: "Squar",
//         sizeA: 4,
//         sizeB: 4
//     },
//     {
//         figure: "Rectangle",
//         sizeA: 4,
//         sizeB: 8
//     }
// ]
// 3) Написати функцію яка отримує масив і число(число відповідає за кількість значень виведених з масива)  якщо число не вказано то вивести 1 значення
// 4) let arr = ['First value', 'test', 'Last ']
// // Написати функцію що отримує значення(first чи last)  та массив, якщо значення first то видаляє перше значення з масива якщо last видаляє останнє значення